ТЗITСервис/src/Documents/Реализация/Реализация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Реализация</name>
  <registerRecords>AccumulationRegister.Остатки</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ТЗITСервис/src/AccumulationRegisters/Остатки/Остатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Остатки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ТЗITСервис/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ТЗITСервис/src/Documents/Реализация/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
    Движения.Остатки.Очистить();
	Движения.Остатки.Записывать = Истина; 
	Движения.Записать(); 
	
	Движения.Взаиморасчеты.Очистить();
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.Записать(); 	
	
	СуммаДокумента = 0;  
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТовары.Номенклатура КАК Номенклатура,
		|	СУММА(РеализацияТовары.Количество) КАК Количество,
		|	СУММА(РеализацияТовары.Сумма) КАК Сумма,
		|	МИНИМУМ(РеализацияТовары.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_ТоварыИзНакладной
		|ИЗ
		|	Документ.Реализация.Товары КАК РеализацияТовары
		|ГДЕ
		|	РеализацияТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТовары.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РеализацияТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыИзНакладной.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыИзНакладной.Количество КАК КоличествоПродажи,
		|	ВТ_ТоварыИзНакладной.НомерСтроки КАК НомерСтроки,
		|	ВТ_ТоварыИзНакладной.Сумма КАК СуммаПродажи,
		|	ЕСТЬNULL(ОстаткиТоваровНаСкладе.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ОстаткиТоваровНаСкладе.Номенклатура.Представление КАК НоменклатураПредставление
		|ИЗ
		|	ВТ_ТоварыИзНакладной КАК ВТ_ТоварыИзНакладной
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОстаткиТоваров.Номенклатура КАК Номенклатура,
		|			ОстаткиТоваров.КоличествоОстаток КАК КоличествоОстаток
		|		ИЗ
		|			РегистрНакопления.Остатки.Остатки(
		|					&МоментВремени,
		|					Номенклатура В
		|							(ВЫБРАТЬ
		|								ВТ_ТоварыИзНакладной.Номенклатура
		|							ИЗ
		|								ВТ_ТоварыИзНакладной)
		|						И Склад = &Склад) КАК ОстаткиТоваров) КАК ОстаткиТоваровНаСкладе
		|		ПО ВТ_ТоварыИзНакладной.Номенклатура = ОстаткиТоваровНаСкладе.Номенклатура";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ПроверкаОстатковУспешна = Истина;
	Пока Выборка.Следующий() Цикл
		СуммаДокумента = СуммаДокумента + Выборка.СуммаПродажи;  
		
		Если  Выборка.КоличествоОстаток < Выборка.КоличествоПродажи Тогда
		     Сообщение = Новый СообщениеПользователю;
			 Сообщение.Текст = "Не хватает товара """ + Выборка.НоменклатураПредставление + """. На складе осталось только " + Выборка.КоличествоОстаток;
			 Сообщение.Поле ="Товары.[" + Выборка.НомерСтроки + "].Количество";
			 Сообщение.УстановитьДанные(ЭтотОбъект);
			 Сообщение.Сообщить();
			 Отказ=Истина;
		КонецЕсли;
		
		Если Отказ Тогда
		    Продолжить;	
		КонецЕсли;						
		 
			Движение = Движения.Остатки.ДобавитьРасход();
			Движение.Период = Дата;
            Движение.Номенклатура = Выборка.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = Выборка.КоличествоПродажи; 	
		
	КонецЦикла;
	
	
	Движение = Движения.Взаиморасчеты.ДобавитьРасход();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Сумма = СуммаДокумента;
	Движение.КодОперации = "Увеличение долга контрагента перед организацией";
	
	Движения.Остатки.Записывать = Истина; 
	Движения.Взаиморасчеты.Записывать = Истина;


КонецПроцедуры
